Repository: evelyyyn-cc/policylens
Catalog: FullStack-Language/policylens/locale/*/LC_MESSAGES/django.po
Languages: ms

source: AI Chatbot
ms: Chatbot AI

source: Home
ms: Laman Utama

source: Our AI chatbot is designed to help you understand how Malaysia's diesel subsidy policies affect your personal situation. Whether you're a student, young professional, or just curious about policy impacts, our chatbot can provide clear, accessible explanations tailored to your needs.
ms: Chatbot AI kami direka untuk membantu anda memahami bagaimana dasar subsidi diesel Malaysia memberi kesan kepada situasi peribadi anda. Sama ada anda seorang pelajar, profesional muda, atau sekadar ingin tahu tentang kesan dasar, chatbot kami boleh memberikan penjelasan yang jelas dan mudah difahami mengikut keperluan anda.

source: Hello! I'm PolicyBot, your guide to understanding Malaysia's diesel subsidy policy.
ms: Hai! Saya PolicyBot, panduan anda untuk memahami dasar subsidi diesel Malaysia.

source: I can help you understand:
ms: Saya boleh membantu anda memahami:

source: The details and objectives of the current diesel subsidy policy
ms: Butiran dan objektif dasar subsidi diesel semasa

source: How this policy might affect your personal finances
ms: Fahami bagaimana perubahan dasar mempengaruhi perbelanjaan peribadi anda

source: The broader economic impacts on prices and industries
ms: Kesan ekonomi yang lebih luas terhadap harga dan industri

source: Complex policy terminology in simple language
ms: Istilah dasar yang kompleks dalam bahasa yang mudah difahami

source: Data and visualizations related to the policy
ms: Data dan visualisasi berkaitan dasar ini

source: You can type your question below or use one of the predefined prompts to get started!
ms: Anda boleh taip soalan anda di bawah atau gunakan salah satu soalan sedia ada untuk memulakan!

source: Type your question here...
ms: Taip soalan anda di sini...

source: Send
ms: Hantar

source: Quick Questions
ms: Pautan Pantas

source: Click on any category to view common questions, or click directly on a question to ask it.
ms: Klik pada mana-mana kategori untuk melihat soalan biasa, atau klik terus pada soalan untuk bertanya.

source: About The Policy
ms: Selepas Dasar:

source: What is the diesel subsidy policy?
ms: Apakah Dasar Subsidi Diesel?

source: Why was the policy necessary?
ms: Mengapa dasar ini diperlukan?

source: Who benefits from the policy?
ms: Siapa yang mendapat manfaat daripada dasar ini?

source: What is the eligibility criteria?
ms: Kriteria Kelayakan

source: What is the application process?
ms: Proses Permohonan

source: What are the benefits of this policy?
ms: Apakah faedah dasar ini?

source: Eligibility Criteria
ms: Kriteria Kelayakan

source: Who is eligible for diesel subsidies?
ms: Siapa yang layak menerima subsidi diesel?

source: How do I apply for diesel subsidies?
ms: Bagaimanakah cara untuk memohon subsidi diesel?

source: What documents are needed for subsidy application?
ms: Apakah dokumen yang diperlukan untuk permohonan subsidi?

source: Can foreigners apply for diesel subsidies?
ms: Bolehkah warga asing memohon subsidi diesel?

source: Economic Impact
ms: Kesan Ekonomi

source: How does diesel policy affect inflation?
ms: Bagaimana dasar diesel memberi kesan kepada inflasi?

source: What is the impact on manufacturing?
ms: Apakah kesannya terhadap sektor pembuatan?

source: How much does the government save from the reform?
ms: Berapakah jumlah penjimatan kerajaan hasil daripada reformasi ini?

source: Will food prices increase due to diesel subsidy removal?
ms: Adakah harga makanan akan meningkat akibat penghapusan subsidi diesel?

source: Personal Finance
ms: Perbelanjaan Peribadi

source: How can I calculate the impact on my budget?
ms: Bagaimanakah saya boleh mengira kesan terhadap bajet saya?

source: What is the monthly subsidy amount?
ms: Berapakah jumlah subsidi bulanan?

source: How do I get the subsidy if I'm eligible?
ms: Bagaimana saya boleh menerima subsidi jika saya layak?

source: Are there other subsidies available?
ms: Adakah terdapat subsidi lain yang tersedia?

source: CPI Datasets
ms: Set Data IHP

source: Policies
ms: Dasar

source: The Diesel Dilemma
ms: Dilema Diesel

source: CPI Impact
ms: Kesan IHP

source: CPI Data Dashboard
ms: Papan Pemuka Data IHP

source: Fuel Data Dashboard
ms: Papan Pemuka Data Bahan Api

source: Consumer Price Impact
ms: Kesan Harga Pengguna

source: Manufacturing Data Dashboard
ms: Papan Pemuka Data Pembuatan

source: CPI Data
ms: Data IHP

source: State CPI Map
ms: Peta IHP Negeri

source: CPI Dataset Chart
ms: Carta Set Data IHP

source: Year
ms: Tahun

source: Region
ms: Wilayah

source: CPI Dataset by State & Division
ms: Set Data IHP mengikut Negeri & Bahagian

source: Data Source:
ms: Sumber Data:

source: Methodology:
ms: Metodologi:

source: Monthly Country CPI values were collected from official goverment data centers.
ms: Nilai IHP bulanan dikumpulkan dari pusat data rasmi kerajaan.

source: Monthly State CPI values were collected from official goverment data centers.
ms: Nilai IHP bulanan dikumpulkan dari pusat data rasmi kerajaan.

source: State CPI Value Map
ms: Peta IHP Negeri

source: This interactive map shows the CPI (Consumer Price Index) values for different states in Malaysia. Click on a state to see detailed CPI values for different categories in that region.
ms: Peta interaktif ini menunjukkan bagaimana dasar subsidi diesel mempengaruhi kawasan berbeza di Malaysia. Klik pada sesuatu kawasan untuk melihat maklumat terperinci tentang perubahan harga di kawasan tersebut.

source: Note: Data for this map uses latest month available on https://data.gov.my/.
ms: Data untuk peta ini menggunakan bulan terkini yang tersedia di https://data.gov.my/.

source: CPI Value Range
ms: Julat Nilai CPI

source: Lower
ms: Rendah

source: Higher
ms: Kesan Tinggi

source: Select a State
ms: Pilih kawasan

source: Overall CPI Value:
ms: Kesan Harga Keseluruhan:

source: CPI Values by Category
ms: Kesan Mengikut Kategori

source: Transportation
ms: Pengangkutan

source: Food & Beverages
ms: Makanan & Minuman

source: Housing & Utilities
ms: Perumahan & Utiliti

source: Restaurants & Accommodation
ms: Restoran & Penginapan

source: Key Insights:
ms: Penemuan Utama:

source: The sections in the map represents the state CPI values. Colors indicate the overall CPI value level, with darker colors representing higher values.
ms: Bahagian-bahagian dalam peta mewakili nilai CPI negeri. Warna menunjukkan tahap nilai CPI keseluruhan, dengan warna lebih gelap mewakili nilai yang lebih tinggi.

source: Food & Beverages typically shows the highest CPI values, often exceeding 140 in most states.
ms: Makanan & Minuman biasanya menunjukkan nilai CPI tertinggi, sering melebihi 140 di kebanyakan negeri.

source: Transportation CPI values tend to be lower, typically in the 110-125 range.
ms: Nilai CPI Pengangkutan cenderung lebih rendah, biasanya dalam julat 110-125.

source: Restaurant & Accommodation services show significant variation between states, reflecting differences in tourism and economic activity.
ms: Perkhidmatan Restoran & Penginapan menunjukkan variasi ketara antara negeri, mencerminkan perbezaan dalam pelancongan dan aktiviti ekonomi.

source: MCOICOP Chart
ms: Carta MCOICOP

source: Distribution of 5-Digit MCOICOP Subclasses
ms: Taburan Subkelas MCOICOP 5 Digit

source: The sections in the chart represents the MCOICOP divisions (2 digit) and the values for each section represents the number of subclasses (5 digit) for each of the divisions (2 digit). The CPI is calculated using the CPI value of each of the subclasses (5 digit).
ms: Bahagian dalam carta mewakili bahagian MCOICOP (2 digit) dan nilai untuk setiap bahagian mewakili bilangan subkelas (5 digit) untuk setiap bahagian (2 digit). IHP dikira menggunakan nilai IHP bagi setiap subkelas (5 digit).

source: Food & Beverages has the highest weight in the CPI calculation at 27.49%%, reflecting its importance in household budgets.
ms: Makanan & Minuman mempunyai pemberat tertinggi dalam pengiraan IHP pada 27.49%%, mencerminkan kepentingannya dalam belanjawan isi rumah.

source: Transport accounts for 10.90%% of the CPI basket, which explains why the diesel subsidy reform has a significant but no overwelming impact on the overall CPI.
ms: Pengangkutan menyumbang 10.90%% daripada bakul IHP, yang menjelaskan mengapa reformasi subsidi diesel mempunyai kesan yang ketara tetapi tidak terlalu besar pada keseluruhan IHP.

source: Housing & Utilities accounts for 4.74%%, representing another household expense.
ms: Perumahan & Utiliti menyumbang 4.74%%, mewakili satu lagi perbelanjaan isi rumah.

source: This data provides a complete lookup for 2, 3, 4, and 5-digit codes under Malaysia's COICOP (Classification of Individual Consumption According to Purpose).
ms: Data ini menyediakan rujukan lengkap untuk kod 2, 3, 4, dan 5 digit di bawah COICOP Malaysia (Klasifikasi Penggunaan Individu Mengikut Tujuan).

source: Diesel Dilemma
ms: Dilema Diesel

source: Manufacturing Impact
ms: Kesan Terhadap Sektor Pembuatan

source: What is Consumer Price Index (CPI)?
ms: Apakah Indeks Harga Pengguna (IHP)?

source: The Consumer Price Index (CPI) is a measure that examines the average change over time in the prices paid by urban consumers for a basket of goods and services. It's one of the most widely used indicators of inflation. Basically, CPI tells you how much prices are rising or falling for things that regular people buy like food, rent, gas, clothes, healthcare, etc.
ms: Indeks Harga Pengguna (IHP) adalah ukuran yang mengkaji perubahan purata harga yang dibayar oleh pengguna bandar untuk sekumpulan barangan dan perkhidmatan dari masa ke masa. Ia merupakan salah satu petunjuk inflasi yang paling meluas digunakan. Pada asasnya, IHP memberitahu anda tentang kenaikan atau penurunan harga barang-barang yang biasa dibeli oleh orang ramai seperti makanan, sewa, petrol, pakaian, penjagaan kesihatan, dan sebagainya.

source: Personal Price Impact Calculator
ms: Kalkulator Kesan Harga Peribadi

source: CPI Impacts on Categories
ms: Kesan IHP pada Kategori

source: Regional CPI Impact Map
ms: Peta Kesan IHP Serantau

source: Personal Expenditure
ms: Perbelanjaan Peribadi

source: Understand how the policy changes affect your personal expenditure
ms: Fahami bagaimana perubahan dasar mempengaruhi perbelanjaan peribadi anda

source: Disclaimer: Calculation Performed Using Data From December 2024 and May 2024.
ms: Penafian: Pengiraan Dilakukan Menggunakan Data Dari Disember 2024 dan Mei 2024.

source: Your Monthly Expenses
ms: Perbelanjaan Bulanan Anda

source: 📍 Choose Your Location
ms: 📍 Pilih Lokasi Anda

source: Transport
ms: Pengangkutan

source: Housing, Water, Electricity, Gas & Other fuels
ms: Perumahan, Air, Elektrik, Gas & Bahan Api Lain

source: Restaurants & Accommodation Services
ms: Perkhidmatan Restoran & Penginapan

source: Calculate Impact
ms: Kira Kesan

source: Estimated Impact
ms: Anggaran Kesan

source: Monthly Comparison
ms: Perbandingan Bulanan

source: Before Policy:
ms: Sebelum Dasar:

source: After Policy:
ms: Selepas Dasar:

source: Additional monthly cost:
ms: Kos bulanan tambahan:

source: (3.2%% increase)
ms: (kenaikan 3.2%%)

source: Yearly Comparison
ms: Perbandingan Tahunan

source: Additional yearly cost:
ms: Kos tahunan tambahan:

source: Impact Breakdown
ms: Perincian Kesan

source: (11.0%% increase)
ms: (kenaikan 11.0%%)

source: (2.0%% increase)
ms: (kenaikan 2.0%%)

source: House, Water, Electricity, Gas & Other fuels
ms: Rumah, Air, Elektrik, Gas & Bahan Api Lain

source: (1.0%% increase)
ms: (kenaikan 1.0%%)

source: (0.9%% increase)
ms: (kenaikan 0.9%%)

source: Money-Saving Tips
ms: Tip Penjimatan Wang

source: Consider carpooling or public transport to reduce transportation costs
ms: Pertimbangkan perkongsian kereta atau pengangkutan awam untuk mengurangkan kos pengangkutan

source: Buy groceries in bulk and during promotional periods
ms: Beli barang runcit secara pukal dan semasa tempoh promosi

source: Use energy-efficient appliances to reduce utility bills
ms: Gunakan peralatan jimat tenaga untuk mengurangkan bil utiliti

source: Look for government assistance programs available for eligible households
ms: Cari program bantuan kerajaan yang tersedia untuk isi rumah yang layak

source: Impact on CPI Categories
ms: Kesan Mengikut Kategori IHP

source: Understand how the policy changes affect different sectors
ms: Fahami bagaimana perubahan dasar mempengaruhi sektor yang berbeza

source: Major Categories
ms: Kategori Utama

source: Impact by CPI Categories
ms: Kesan Mengikut Kategori IHP

source: The diesel subsidy removal had varying impacts across different categories of the Consumer Price Index. Below is the breakdown of how different sectors were affected:
ms: Penghapusan subsidi diesel mempunyai kesan yang berbeza-beza terhadap kategori Indeks Harga Pengguna yang berlainan. Berikut adalah perincian bagaimana sektor yang berbeza terjejas:

source: 📍 Country State:
ms: 📍 Negeri:

source: Category
ms: Kategori

source: CPI Difference (%%)
ms: Perbezaan IHP (%%)

source: Impact Level
ms: Tahap Kesan

source: Restaurant & Accommodation Services
ms: Perkhidmatan Restoran & Penginapan

source: Housing, Water, Electricity, Gas & Other Fuels
ms: Perumahan, Air, Elektrik, Gas & Bahan Api Lain

source: Impact on CPI Categories Across States
ms: Kesan Mengikut Kategori IHP

source: Understand how the policy affects the country across states
ms: Fahami bagaimana dasar mempengaruhi negara di seluruh negeri

source: Categorial Price Impact Map
ms: Peta Kesan Harga Mengikut Kawasan

source: This interactive map shows how the diesel subsidy policy affects different regions in Malaysia. Click on a region to see detailed information about price changes in that area.
ms: Peta interaktif ini menunjukkan bagaimana dasar subsidi diesel mempengaruhi kawasan berbeza di Malaysia. Klik pada sesuatu kawasan untuk melihat maklumat terperinci tentang perubahan harga di kawasan tersebut.

source: 📚 Impact Category:
ms: 📚 Kategori Kesan:

source: Overall Price Impact
ms: Kesan Harga Keseluruhan

source: Lower Impact
ms: Kesan Rendah

source: Higher Impact
ms: Kesan Tinggi

source: Select a region
ms: Pilih kawasan

source: Overall Price Impact:
ms: Kesan Harga Keseluruhan:

source: Impact by Category
ms: Kesan Mengikut Kategori

source: Reasons for regional differences
ms: Sebab-sebab perbezaan mengikut kawasan

source: East Malaysia (Sabah, Sarawak) and the East Coast states (Kelantan, Terengganu, Pahang) are most affected by the diesel price policy adjustment. The main reasons include:
ms: Malaysia Timur (Sabah, Sarawak) dan negeri-negeri Pantai Timur (Kelantan, Terengganu, Pahang) paling terjejas oleh pelarasan dasar harga diesel. Antara sebab utama termasuk:

source: The logistics distance is long and the transportation cost accounts for a high proportion
ms: Jarak logistik yang jauh dan kos pengangkutan menyumbang kepada sebahagian besar perbelanjaan

source: A high proportion of agricultural and fishing activities are dependent on diesel
ms: Sebahagian besar aktiviti pertanian dan perikanan bergantung kepada diesel

source: Limited alternative transportation options and high private car usage
ms: Pilihan pengangkutan alternatif yang terhad dan penggunaan kereta persendirian yang tinggi

source: There are few consumer goods produced locally, and they rely on foreign supplies
ms: Terdapat sedikit barangan pengguna yang dihasilkan di peringkat tempatan, dan mereka bergantung kepada bekalan luar

source: Targeted policy response
ms: Tindak balas dasar yang disasarkan

source: The government has introduced a series of targeted measures for high-impact areas:
ms: Kerajaan telah memperkenalkan siri langkah-langkah yang disasarkan untuk kawasan yang terjejas teruk:

source: Special logistics subsidy scheme for East Malaysia to reduce transportation costs of essential goods
ms: Skim subsidi logistik khas untuk Malaysia Timur bagi mengurangkan kos pengangkutan barangan keperluan asas

source: Special fuel subsidies for fishermen and farmers in remote areas
ms: Subsidi bahan api khas untuk nelayan dan petani di kawasan pedalaman

source: Investment plans to strengthen food production capacity in East Coast and East Malaysia
ms: Pelan pelaburan untuk memperkukuh kapasiti pengeluaran makanan di Pantai Timur dan Malaysia Timur

source: Long-term planning to expand public transport network coverage
ms: Perancangan jangka panjang untuk memperluaskan liputan rangkaian pengangkutan awam

source: MyPolicyLens - Data Dashboard
ms: MyPolicyLens - Papan Pemuka Data

source: HOME
ms: LAMAN UTAMA

source: POLICY
ms: DASAR

source: FAQ
ms: SOALAN LAZIM

source: AI CHATBOT
ms: BOT SEMBANG AI

source: Household Impact
ms: Kesan Terhadap Isi Rumah

source: Diesel Price
ms: Harga Diesel

source: Registered Vehicles
ms: Kenderaan Berdaftar

source: Fuel Price Dataset
ms: Set Data Harga Bahan Api

source: Diesel East
ms: Diesel Timur

source: Line
ms: Garisan

source: Regional Price Comparison
ms: Perbandingan Harga Mengikut Kawasan

source: Compare diesel prices across different regions after the subsidy reform
ms: Bandingkan harga diesel di seluruh kawasan berbeza selepas reformasi subsidi

source: Weekly fuel prices were collected from official goverment data centers.
ms: Harga bahan api mingguan dikumpulkan dari pusat data rasmi kerajaan.

source: Registered Vehicles Dataset
ms: Set Data Kenderaan Berdaftar

source: Vehicle Types Distribution (2024)
ms: Taburan Jenis Kenderaan (2024)

source: Total Registered Diesel Vehicles
ms: Jumlah Kenderaan Diesel Berdaftar

source: Vehicle registration records aggregated by type, state, and year. Updated monthly.
ms: Rekod pendaftaran kenderaan diagregatkan mengikut jenis, negeri, dan tahun. Dikemaskini setiap bulan.

source: Quick Links
ms: Pautan Pantas

source: About us
ms: Tentang Kami

source: MYPolicyLens - The Diesel Dilemma
ms: MYPolicyLens - Dilema Diesel

source: Malaysia's 2024 Subsidy Transformation
ms: Transformasi Subsidi Malaysia 2024

source: What is the Diesel Subsidy Policy?
ms: Apakah Dasar Subsidi Diesel?

source: In June 2024, Malaysia implemented a targeted diesel subsidy policy aimed at reducing government expenditure and ensuring that subsidies benefit those most in need. Prior to this reform, diesel was heavily subsidized, leading to significant financial burdens on the government. The cost of diesel subsidies escalated from RM1.4 billion in 2019 to RM14.3 billion in 2023.
ms: Pada Jun 2024, Malaysia melaksanakan dasar subsidi diesel bersasar yang bertujuan untuk mengurangkan perbelanjaan kerajaan dan memastikan subsidi memberi manfaat kepada mereka yang paling memerlukan. Sebelum reformasi ini, diesel disubsidi secara besar-besaran, menyebabkan beban kewangan yang ketara kepada kerajaan. Kos subsidi diesel meningkat dari RM1.4 bilion pada 2019 kepada RM14.3 bilion pada 2023.

source: Disclaimer: This analysis was performed in April 2025.
ms: Penafian: Analisis ini dilakukan pada April 2025.

source: The Challenge
ms: Cabaran

source: Targeted Approach
ms: Pendekatan Bersasar

source: Financial Perspective
ms: Perspektif Kewangan

source: Future Outlook
ms: Tinjauan Masa Depan

source: Why Reform Was Necessary
ms: Mengapa Reformasi Diperlukan

source: Malaysia's diesel subsidy expenditure increased dramatically over recent years, creating an unsustainable burden on government finances. The rapid rise in subsidy costs became a pressing issue that demanded reform.
ms: Perbelanjaan subsidi diesel Malaysia meningkat secara dramatik sejak beberapa tahun kebelakangan ini, mewujudkan beban yang tidak mampan pada kewangan kerajaan. Peningkatan pesat dalam kos subsidi menjadi isu mendesak yang memerlukan reformasi.

source: Subsidy Cost Explosion
ms: Ledakan Kos Subsidi

source: The annual cost of diesel subsidies skyrocketed from:
ms: Kos tahunan subsidi diesel melonjak dari:

source: 1.4 billion MYR
ms: 1.4 bilion MYR

source: 14.3 billion MYR
ms: 14.3 bilion MYR

source: A staggering 1021%% increase in just four years
ms: Peningkatan mendadak sebanyak 1021%% dalam tempoh empat tahun sahaja

source: Diesel consumption growth significantly outpaced vehicle registration:
ms: Pertumbuhan penggunaan diesel jauh mengatasi pendaftaran kenderaan:

source: Cumulative Growth
ms: Pertumbuhan Kumulatif

source: Yearly View
ms: Paparan Tahunan

source: The solid blue line shows how much total diesel use has grown since 2021. The gold dashed line shows how much the number of diesel vehicles has grown. By 2023, diesel use has risen much more than vehicle numbers, so it’s the same trucks and cars using more fuel, not just more vehicles on the road.
ms: Garisan biru pejal menunjukkan pertumbuhan penggunaan diesel keseluruhan sejak 2021. Garisan putus-putus emas menunjukkan pertumbuhan bilangan kenderaan diesel. Menjelang 2023, penggunaan diesel meningkat lebih tinggi berbanding bilangan kenderaan, bermakna lori dan kereta yang sama menggunakan lebih banyak bahan api, bukan sekadar lebih banyak kenderaan di jalan raya.

source: In this view, the blue line tracks total diesel burned each year, and the gold dashed line tracks how many diesel vehicles were added each year. Even when fewer new vehicles were registered in 2023, fuel use kept climbing. That means the existing vehicles are driving farther or hauling heavier loads, using more diesel per vehicle.
ms: Dalam paparan ini, garisan biru menjejaki jumlah diesel yang digunakan setiap tahun, manakala garisan putus-putus emas menjejaki bilangan kenderaan diesel yang ditambah setiap tahun. Walaupun pendaftaran kenderaan baharu berkurang pada 2023, penggunaan bahan api terus meningkat. Ini bermakna kenderaan sedia ada memandu lebih jauh atau mengangkut muatan lebih berat, menggunakan lebih banyak diesel per kenderaan.

source: Cross-Border Leakage
ms: Kebocoran Merentasi Sempadan

source: Luxury car representing fuel subsidy leakage
ms: Kereta mewah mewakili kebocoran subsidi bahan api

source: Singapore
ms: Singapura

source: per liter
ms: seliter

source: Diesel Price Comparison with Neighbouring Countries (June 2024)
ms: Perbandingan Harga Diesel dengan Negara Jiran (Jun 2024)

source: The diesel price increased from RM2.15 per liter to RM3.35 per liter, a 56%% increase. This adjustment aligns the price more closely with market rates while targeted assistance programs help mitigate the impact on vulnerable groups.
ms: Harga diesel meningkat dari RM2.15 seliter kepada RM3.35 seliter, peningkatan sebanyak 56%%. Pelarasan ini menyelaraskan harga dengan lebih dekat dengan kadar pasaran sementara program bantuan bersasar membantu mengurangkan kesan terhadap kumpulan yang mudah terjejas.

source: Source: Ministry of Finance Malaysia. (2024, June 9). Government Implements Targeted Diesel Subsidy for Peninsular Malaysia Effective 10 June 2024. Retrieved from
ms: Sumber: Kementerian Kewangan Malaysia. (2024, Jun 9). Kerajaan Melaksanakan Subsidi Diesel Bersasar untuk Semenanjung Malaysia Berkuat Kuasa 10 Jun 2024. Diambil dari

source: Source: Diesel Price Increase to RM3.35 Per Litre Effective Today, June 10, 2024. Retrieved from
ms: Sumber: Harga Diesel Meningkat kepada RM3.35 Seliter Berkuatkuasa Hari Ini, 10 Jun, 2024. Diambil dari

source: The Targeted Approach
ms: Pendekatan Bersasar

source: Ensuring Support Reaches the Right People
ms: Memastikan Sokongan Sampai kepada Orang yang Tepat

source: Beneficiary Groups
ms: Kumpulan Penerima Manfaat

source: Private Vehicle Owners
ms: Pemilik Kenderaan Persendirian

source: Farmers
ms: Petani

source: Livestock Breeders
ms: Penternak Haiwan

source: Aquaculture Farmers
ms: Penternak Akuakultur

source: Valid Malaysian citizenship required
ms: Kewarganegaraan Malaysia yang sah diperlukan
