Repository: evelyyyn-cc/policylens
Catalog: FullStack-Language/policylens/locale/*/LC_MESSAGES/djangojs.po
Languages: ms

source: line
ms: garisan

source: Error initializing diesel price charts:
ms: Ralat semasa memulakan carta harga diesel:

source: All Years
ms: Semua Tahun

source: all years
ms: semua tahun

source: All Regions
ms: Semua Wilayah

source: Private Vehicle Owners
ms: Pemilik Kenderaan Persendirian

source: Farmers
ms: Petani

source: Livestock Breeders
ms: Penternak Ternakan

source: Aquaculture Farmers
ms: Penternak Akuakultur

source: English
ms: Bahasa Inggeris

source: Ready to implement policy filters
ms: Sedia untuk melaksanakan penapis polisi

source: Read More
ms: Baca Lagi

source: Diesel Subsidy Reform: What's Going to Cost You?
ms: Reformasi Subsidi Diesel: Berapakah Kos untuk Anda?

source: Subsidies are changing. Prices are rising.<br>Find out how this new policy could hit your wallet—and what it really means for your daily life.
ms: Subsidi sedang berubah. Harga semakin meningkat.<br>Ketahui bagaimana dasar baru ini boleh memberi kesan kepada dompet anda—dan apa maknanya bagi kehidupan harian anda.

source: New Education Budget: The Impact on Schools
ms: Bajet Pendidikan Baru: Kesan terhadap Sekolah

source: The government's latest education budget has major implications for schools across Malaysia.<br>Learn how this affects students, teachers, and families.
ms: Bajet pendidikan terbaru kerajaan mempunyai implikasi besar bagi sekolah-sekolah di seluruh Malaysia.<br>Ketahui bagaimana ini memberi kesan kepada pelajar, guru, dan keluarga.

source: Healthcare System Changes: What You Need to Know
ms: Perubahan Sistem Kesihatan: Apa yang Anda Perlu Tahu

source: Major restructuring in our healthcare system is coming.<br>Discover what services will change and how it affects your access to care.
ms: Penstrukturan semula besar dalam sistem kesihatan kita akan datang.<br>Ketahui perkhidmatan apa yang akan berubah dan bagaimana ia memberi kesan kepada akses penjagaan anda.

source: Environmental Protection Act: New Regulations
ms: Akta Perlindungan Alam Sekitar: Peraturan Baru

source: New environmental regulations are being implemented nationwide.<br>See how these changes will impact businesses and communities.
ms: Peraturan alam sekitar baru sedang dilaksanakan di seluruh negara.<br>Lihat bagaimana perubahan ini akan memberi kesan kepada perniagaan dan masyarakat.
