Repository: evelyyyn-cc/policylens
Catalog: FullStack-Language/policylens/locale/*/LC_MESSAGES/django.po
Languages: ms

source: The fuel sensitivity score is calculated to assess how much a manufacturing sector's output responds to diesel price changes. First, for each month in 2024, the average difference in industrial production growth (IPI growth) between the before and after policy periods is computed for each industry. Then, this growth difference is divided by the percentage change in diesel prices for the same month. This gives a monthly “sensitivity contribution.” Finally, these monthly values are averaged across the year to produce the sector’s fuel sensitivity score — a higher score indicates a stronger response of output to diesel price fluctuations.
ms: Skor sensitiviti bahan api dikira untuk menilai sejauh mana output sektor pembuatan bertindak balas terhadap perubahan harga diesel. Pertama, bagi setiap bulan dalam tahun 2024, purata perbezaan pertumbuhan pengeluaran industri (pertumbuhan IPI) antara tempoh sebelum dan selepas polisi dikira untuk setiap industri. Kemudian, perbezaan pertumbuhan ini dibahagikan dengan perubahan peratus harga diesel pada bulan yang sama. Ini memberikan ‘sumbangan sensitiviti’ bulanan. Akhir sekali, nilai bulanan ini puratanya diambil sepanjang tahun untuk menghasilkan skor sensitiviti bahan api bagi sektor tersebut — skor yang lebih tinggi menunjukkan tindak balas output yang lebih kuat terhadap turun naik harga diesel.

source: Impact Ranking:
ms: Perincian Kesan:

source: The divisions shown here represent the top 10 fuel-sensitive sectors based on their calculated sensitivity scores.
ms: Bahagian yang ditunjukkan di sini mewakili 10 sektor paling sensitif bahan api berdasarkan skor sensitiviti yang dikira.

source: Why These Sectors Are More Affected
ms: Mengapa Sektor-Sektor Ini Lebih Terjejas

source: The sectors most impacted by the diesel subsidy policy changes share key characteristics:
ms: Sektor yang paling terjejas oleh perubahan dasar subsidi diesel berkongsi ciri-ciri utama berikut:

source: High energy intensity:
ms: Intensiti tenaga tinggi:

source: Industries like Fabricated Metal Products and Chemicals and Chemical Products require large amounts of fuel for manufacturing processes.
ms: Industri seperti Produk Logam Fabrikasi dan Bahan Kimia serta Produk Kimia memerlukan jumlah bahan api yang besar untuk proses pembuatan.

source: Dependence on diesel-powered machinery:
ms: Kebergantungan kepada mesin yang dikuasakan diesel:

source: Sectors such as Machinery Repair and Installation rely directly on diesel for operational equipment.
ms: Sektor seperti Pembaikan dan Pemasangan Mesin bergantung secara langsung kepada diesel untuk peralatan operasi.

source: Reliance on road transport:
ms: Kebergantungan pada pengangkutan jalan:

source: Industries like Wearing Apparel and Rubber and Plastics Products depend on logistics networks powered by diesel for raw materials and product delivery.
ms: Industri seperti Pakaian dan Produk Getah serta Plastik bergantung pada rangkaian logistik yang dikuasakan diesel untuk penghantaran bahan mentah dan produk.

source: Fuel-sensitive supply chains:
ms: Rantaian bekalan sensitif bahan api:

source: Sectors such as Computer, Electronic, and Optical Products are part of global supply chains where fuel costs can significantly impact competitiveness.
ms: Sektor seperti Produk Komputer, Elektronik, dan Optik merupakan sebahagian dari rantaian bekalan global di mana kos bahan api boleh memberi impak besar kepada daya saing.

source: Limited alternatives to diesel:
ms: Alternatif diesel yang terhad:

source: For sectors like Coke and Refined Petroleum Products, diesel is not just a cost but also a core input, leaving little flexibility in adapting to price shocks.
ms: Bagi sektor seperti Kok dan Produk Petroleum Halus, diesel bukan sahaja kos tetapi juga input utama, menyebabkan kekurangan fleksibiliti untuk menyesuaikan dengan kejutan harga.

source: Source: Department of Statistics Malaysia, IPI by Division (2 digit) Data, Feb 2025
ms: Sumber: Jabatan Perangkaan Malaysia, Data IPI mengikut Bahagian (2 digit), Feb 2025

source: This chart shows the monthly Manufacturing Production Index (blue line, base year 2015=100) and average diesel price (orange line, RM/L) from January to December 2024. The IPI reflects actual manufacturing output, while diesel prices capture fuel cost changes across the same period.
ms: Carta ini menunjukkan Indeks Pengeluaran Pembuatan bulanan (garisan biru, tahun asas 2015=100) dan harga diesel purata (garisan oren, RM/L) dari Januari hingga Disember 2024. IPI mencerminkan output pembuatan sebenar, manakala harga diesel menangkap perubahan kos bahan api sepanjang tempoh yang sama.

source: What Citizens Should Know:
ms: Apa yang Warga Perlu Tahu:

source: Output Stayed Strong Despite Higher Diesel Prices:
ms: Output Kekal Kukuh Walaupun Harga Diesel Meningkat:

source: Even after diesel prices rose in June, the manufacturing sector continued expanding through August — showing short-term resilience and possible preparation ahead of the reform.
ms: Walaupun harga diesel meningkat pada bulan Jun, sektor pembuatan terus berkembang hingga Ogos — menunjukkan ketahanan jangka pendek dan kemungkinan persiapan sebelum reformasi.

source: Slowdown in Late 2024:
ms: Perlahan pada Akhir 2024:

source: After peaking in August, the manufacturing index declined moderately from September to December. This suggests that higher fuel costs may have gradually impacted industrial output, particularly for fuel-intensive sectors.
ms: Selepas mencapai puncak pada Ogos, indeks pembuatan menurun secara sederhana dari September hingga Disember. Ini menunjukkan kos bahan api yang lebih tinggi mungkin secara beransur-ansur menjejaskan output industri, terutamanya untuk sektor yang memerlukan banyak bahan api.

source: Why Diesel Prices Matter:
ms: Mengapa Harga Diesel Penting:

source: Diesel is widely used in transportation, logistics, and factory operations. A rise in diesel prices typically increases production costs, which may later affect consumer prices, job stability, or SME performance.
ms: Diesel digunakan secara meluas dalam pengangkutan, logistik, dan operasi kilang. Kenaikan harga diesel biasanya meningkatkan kos pengeluaran, yang kemudiannya boleh menjejaskan harga pengguna, kestabilan pekerjaan, atau prestasi PKS.

source: Big vs Small Businesses:
ms: Perniagaan Besar vs Kecil:

source: Large manufacturers may absorb cost increases better, while small and medium enterprises (SMEs) could feel the squeeze first — possibly leading to slower growth or reduced activity in some sectors.
ms: Pengilang besar mungkin dapat menyerap kenaikan kos dengan lebih baik, manakala perusahaan kecil dan sederhana (PKS) mungkin terkesan terlebih dahulu — berkemungkinan menyebabkan pertumbuhan yang lebih perlahan atau pengurangan aktiviti dalam beberapa sektor.

source: Policy Effects Take Time:
ms: Kesan Polisi Memerlukan Masa:

source: The data suggests that policy changes don’t cause immediate disruption, but effects can build up over time — making it important to monitor both production trends and price movements together.
ms: Data menunjukkan bahawa perubahan polisi tidak menyebabkan gangguan segera, tetapi kesannya boleh bertambah dari masa ke masa — menjadikan pemantauan bersama trend pengeluaran dan pergerakan harga adalah penting.

source: Dataset:
ms: Set Data IHP

source: IPI by Division (2-digit)
ms: IPI mengikut Bahagian (2 digit)

source: Monthly manufacturing index (absolute values) from January to December 2024, categorized under Section C (Manufacturing), base year 2015 = 100.
ms: Indeks pembuatan bulanan (nilai mutlak) dari Januari hingga Disember 2024, dikategorikan di bawah Seksyen C (Pembuatan), tahun asas 2015 = 100.

source: Official Fuel Prices – Government of Malaysia
ms: Harga Bahan Api Rasmi – Kerajaan Malaysia

source: Price of Petroleum & Diesel (CSV)
ms: Harga Petroleum & Diesel (CSV)

source: Monthly average diesel prices collected for 2024, based on official level pricing records.
ms: Harga diesel purata bulanan yang dikumpul untuk tahun 2024, berdasarkan rekod harga rasmi.

source: PolicyLens - Policies
ms: PolicyLens - Dasar

source: Featured Policies
ms: Dasar Pilihan

source: Diesel Subsidy Malaysia
ms: Subsidi Diesel Malaysia

source: Date
ms: Tarikh

source: June 2024
ms: Jun 2024

source: In June 2024, Malaysia implemented a targeted diesel subsidy policy aimed at reducing government expenditure and ensuring that subsidies benefit those most in need. Prior to this reform, diesel was heavily subsidized, leading to significant financial burdens on the government.
ms: Pada Jun 2024, Malaysia melaksanakan dasar subsidi diesel bersasar yang bertujuan mengurangkan perbelanjaan kerajaan dan memastikan subsidi memberi manfaat kepada golongan yang paling memerlukan. Sebelum reformasi ini, diesel disubsidi secara besar-besaran, menyebabkan beban kewangan yang besar kepada kerajaan.

source: Read More
ms: Baca Lagi
