Repository: evelyyyn-cc/policylens
Catalog: FullStack-Language/policylens/locale/*/LC_MESSAGES/django.po
Languages: ms

source: Individual or household income threshold
ms: Had pendapatan individu atau isi rumah

source: Private diesel vehicle registered with JPJ
ms: Kenderaan diesel persendirian yang berdaftar dengan JPJ

source: Non-luxury vehicles under 10 years old
ms: Kenderaan bukan mewah berusia kurang dari 10 tahun

source: More eligibility details
ms: Butiran kelayakan lanjut

source: Application Process
ms: Proses Permohonan

source: Check Eligibility
ms: Semak Kelayakan

source: Verify if you meet the income and vehicle requirements
ms: Pastikan anda memenuhi syarat pendapatan dan kenderaan

source: Online Application
ms: Permohonan Dalam Talian

source: Complete application at <a href="https://budimadani.gov.my/" target="_blank">budimadani.gov.my</a>
ms: Lengkapkan permohonan di <a href="https://budimasani.gov.my" target="_blank">budimasani.gov.my</a>

source: Verification Period
ms: Tempoh Pengesahan

source: Application verified against LHDNM records
ms: Permohonan disahkan berdasarkan rekod LHDNM

source: Monthly Disbursement
ms: Pembayaran Bulanan

source: RM 200 transferred to approved applicants' bank accounts
ms: RM 200 dipindahkan ke akaun bank pemohon yang diluluskan

source: Current Implementation Status
ms: Status Pelaksanaan Semasa

source: Estimated Eligible
ms: Anggaran Layak

source: Applications Approved
ms: Permohonan Diluluskan

source: Source: Ministry of Finance Malaysia. (2024, Mar 22). Program Bantuan Subsidi MADANI Open For Application. Retrieved from
ms: Sumber: Kementerian Kewangan Malaysia. (2024, Mac 22). Program Bantuan Subsidi MADANI Dibuka Untuk Permohonan. Diambil dari

source: Source: Ministry of Finance Malaysia. (2024, June 9). 100,000 Civil Service Cash Assistance Applications Approved. Retrieved from
ms: Sumber: Kementerian Kewangan Malaysia. (2024, 9 Jun). 100,000 Permohonan Bantuan Tunai Perkhidmatan Awam Diluluskan. Diambil dari

source: The Financial Perspective
ms: Perspektif Kewangan

source: Fiscal Impact and Resource Allocation
ms: Kesan Fiskal dan Peruntukan Sumber

source: Annual Savings Projection
ms: Unjuran Penjimatan Tahunan

source: Estimated Annual Savings
ms: Anggaran Penjimatan Tahunan

source: Approximately USD 852 million
ms: Kira-kira USD 852 juta

source: The diesel subsidy reform is expected to generate significant savings for the Malaysian government, which can be redirected to other priority areas. The implementation also varies by region. The targeted diesel subsidy policy is expected to save the government approximately RM4 billion (USD 852 million) annually.
ms: Reformasi subsidi diesel dijangka menjana penjimatan yang ketara bagi kerajaan Malaysia, yang boleh disalurkan semula ke bidang keutamaan lain. Pelaksanaannya juga berbeza mengikut kawasan. Dasar subsidi diesel bersasar dijangka menjimatkan kerajaan sebanyak RM4 bilion (USD 852 juta) setiap tahun.

source: Source: MOF. (2024, June 9). Diesel Price In Peninsula Set At RM3.35 Per Litre From 12.01am Monday. Retrieved from
ms: Sumber: Harga Diesel Meningkat kepada RM3.35 Seliter Berkuatkuasa Hari Ini, 10 Jun, 2024. Diambil dari

source: Budget Reallocation
ms: Pengagihan Semula Bajet

source: Before Reform
ms: Sebelum Reformasi

source: Broad-based subsidies
ms: Subsidi umum

source: Universal benefit
ms: Manfaat universal

source: Escalating costs
ms: Kos meningkat

source: After Reform
ms: Selepas Reformasi

source: Targeted assistance
ms: Bantuan bersasar

source: Enhanced social services
ms: Perkhidmatan sosial dipertingkatkan

source: Infrastructure investment
ms: Pelaburan infrastruktur

source: The savings from the fuel subsidy rationalization are expected to be reallocated to other aid programs and initiatives, such as cash assistance for low-income groups, improving the well-being of vulnerable Malaysians, and financing free nutritious meal programs in schools.
ms: Penjimatan daripada rasionalisasi subsidi bahan api dijangka disalurkan semula kepada program bantuan dan inisiatif lain, seperti bantuan tunai untuk golongan berpendapatan rendah, meningkatkan kesejahteraan rakyat Malaysia yang terdedah, dan membiayai program makanan berkhasiat percuma di sekolah.

source: Regional Price Differences
ms: Perbezaan Harga Mengikut Wilayah

source: Peninsular Malaysia
ms: Semenanjung Malaysia

source: Market price (following June 10 reform)
ms: Harga pasaran (berikutan reformasi 10 Jun)

source: Maintained at subsidized price
ms: Dikekalkan pada harga bersubsidi

source: The diesel subsidy reform has been implemented differently across Malaysia's regions, with distinct approaches for Peninsular Malaysia versus East Malaysia.
ms: Reformasi subsidi diesel telah dilaksanakan secara berbeza di seluruh wilayah Malaysia, dengan pendekatan yang berbeza antara Semenanjung Malaysia dan Malaysia Timur.

source: Source: Ministry of Finance Malaysia. (2024, June 9). Government Implements Targeted Diesel Subsidy for Peninsular Malaysia Effective 10 June 2024. Retrieved from
ms: Sumber: Kementerian Kewangan Malaysia. (9 Jun 2024). Kerajaan Melaksanakan Subsidi Diesel Bersasar untuk Semenanjung Malaysia Berkuat Kuasa 10 Jun 2024. Dipetik dari

source: The Future Outlook
ms: Tinjauan Masa Depan

source: What Comes Next and Long-Term Benefits
ms: Langkah Seterusnya dan Manfaat Jangka Panjang

source: Future Policy Roadmap
ms: Peta Jalan Dasar Masa Depan

source: Phase 1 (Completed)
ms: Fasa 1 (Selesai)

source: Diesel Subsidy Reform
ms: Reformasi Subsidi Diesel

source: Implementation of market pricing for diesel with targeted cash assistance
ms: Pelaksanaan harga pasaran untuk diesel dengan bantuan tunai bersasar

source: Phase 2 (Late 2024)
ms: Fasa 2 (Akhir 2024)

source: RON95 Petrol Subsidy Reform
ms: Reformasi Subsidi Petrol RON95

source: Similar targeted approach for RON95 petrol, currently priced at RM 2.05 per liter
ms: Pendekatan bersasar serupa untuk petrol RON95, kini berharga RM2.05 seliter

source: Phase 3 (2025)
ms: Fasa 3 (2025)

source: Comprehensive Subsidy Rationalization
ms: Rasionalisasi Subsidi yang Komprehensif

source: Review and optimization of other subsidy programs
ms: Kajian semula dan pengoptimuman program subsidi lain

source: Phase 4 (2025-2026)
ms: Fasa 4 (2025-2026)

source: Sustainable Energy Transition
ms: Peralihan Tenaga Lestari

source: Incentives for renewable energy and sustainable transportation
ms: Insentif untuk tenaga boleh diperbaharui dan pengangkutan lestari

source: Expected Long-Term Benefits
ms: Faedah Jangka Panjang yang Dijangkakan

source: Fiscal Sustainability
ms: Kemampanan Fiskal

source: Projected reduction in fiscal deficit from 5.8%% to 3.8%% of GDP by 2025
ms: Pengurangan defisit fiskal yang diunjurkan daripada 5.8%% kepada 3.8%% daripada KDNK menjelang 2025

source: Enhanced Social Services
ms: Perkhidmatan Sosial yang Dipertingkatkan

source: Reallocation of funds to healthcare, education, and social protection
ms: Penyaluran semula dana kepada penjagaan kesihatan, pendidikan, dan perlindungan sosial

source: Infrastructure Development
ms: Pembangunan Infrastruktur

source: Increased investment in critical infrastructure projects
ms: Pelaburan yang meningkat dalam projek infrastruktur kritikal

source: Environmental Impact
ms: Kesan Alam Sekitar

source: Reduced fuel consumption and related environmental benefits
ms: Pengurangan penggunaan bahan api dan manfaat alam sekitar yang berkaitan

source: Economic Resilience
ms: Ketahanan Ekonomi

source: Better protection against global energy price volatility
ms: Perlindungan yang lebih baik terhadap turun naik harga tenaga global

source: Following the diesel subsidy reform, the Malaysian government plans to implement similar targeted subsidy mechanisms for RON95 petrol. This is part of a comprehensive strategy to rationalize subsidies across the board, ensuring that they benefit those who need them most while reducing fiscal leakage and promoting a more sustainable financial model.
ms: Berikutan reformasi subsidi diesel, kerajaan Malaysia merancang untuk melaksanakan mekanisme subsidi bersasar yang serupa bagi petrol RON95. Ini adalah sebahagian daripada strategi komprehensif untuk merasionalisasi subsidi secara menyeluruh, memastikan bantuan disasarkan kepada golongan yang benar-benar memerlukan sambil mengurangkan kebocoran fiskal dan menggalakkan model kewangan yang lebih lestari.

source: Source: Bernama. (2025, April 24). Malaysia's Great Shift: Navigating The High Stakes Of Targeted Subsidies. Retrieved from
ms: Sumber: Bernama. (2025, 24 April). Peralihan Besar Malaysia: Mengemudi Subsidi Sasaran Yang Berisiko Tinggi. Diambil dari

source: The solid blue line shows how much total diesel use has grown since 2021. The gold dashed line shows how much the number of diesel vehicles has grown. By 2023, diesel use has risen much more than vehicle numbers, so it’s the same trucks and cars using more fuel, not just more vehicles on the road.
ms: Garisan biru pejal menunjukkan pertumbuhan penggunaan diesel keseluruhan sejak 2021. Garisan putus-putus emas menunjukkan pertumbuhan bilangan kenderaan diesel. Menjelang 2023, penggunaan diesel meningkat lebih tinggi berbanding bilangan kenderaan, bermakna lori dan kereta yang sama menggunakan lebih banyak bahan api, bukan sekadar lebih banyak kenderaan di jalan raya.

source: In this view, the blue line tracks total diesel burned each year, and the gold dashed line tracks how many diesel vehicles were added each year. Even when fewer new vehicles were registered in 2023, fuel use kept climbing. That means the existing vehicles are driving farther or hauling heavier loads, using more diesel per vehicle.
ms: Dalam paparan ini, garisan biru menjejaki jumlah diesel yang digunakan setiap tahun, manakala garisan putus-putus emas menjejaki bilangan kenderaan diesel yang ditambah setiap tahun. Walaupun pendaftaran kenderaan baharu berkurang pada 2023, penggunaan bahan api terus meningkat. Ini bermakna kenderaan sedia ada memandu lebih jauh atau mengangkut muatan lebih berat, menggunakan lebih banyak diesel per kenderaan.

source: The diesel price increased from RM2.15 per liter to RM3.35 per liter, a 56%% increase. This adjustment aligns the price more closely with market rates while targeted assistance programs help mitigate the impact on vulnerable groups.
ms: Harga diesel meningkat dari RM2.15 seliter kepada RM3.35 seliter, peningkatan sebanyak 56%%. Pelarasan ini menyelaraskan harga dengan lebih dekat dengan kadar pasaran sementara program bantuan bersasar membantu mengurangkan kesan terhadap kumpulan yang mudah terjejas.

source: Source: Ministry of Finance Malaysia. (2024, June 9). Government Implements Targeted Diesel Subsidy for Peninsular Malaysia Effective 10 June 2024. Retrieved from
ms: Sumber: Kementerian Kewangan Malaysia. (2024, Jun 9). Kerajaan Melaksanakan Subsidi Diesel Bersasar untuk Semenanjung Malaysia Berkuat Kuasa 10 Jun 2024. Diambil dari

source: Previous Section
ms: Bahagian Sebelumnya

source: The diesel subsidy reform is expected to generate significant savings for the Malaysian government, which can be redirected to other priority areas. The implementation also varies by region. The targeted diesel subsidy policy is expected to save the government approximately RM4 billion (USD 852 million) annually.
ms: Reformasi subsidi diesel dijangka menjana penjimatan yang ketara bagi kerajaan Malaysia, yang boleh disalurkan semula ke bidang keutamaan lain. Pelaksanaannya juga berbeza mengikut kawasan. Dasar subsidi diesel bersasar dijangka menjimatkan kerajaan sebanyak RM4 bilion (USD 852 juta) setiap tahun.

source: Source: Ministry of Finance Malaysia. (2024, June 9). Government Implements Targeted Diesel Subsidy for Peninsular Malaysia Effective 10 June 2024. Retrieved from
ms: Sumber: Kementerian Kewangan Malaysia. (9 Jun 2024). Kerajaan Melaksanakan Subsidi Diesel Bersasar untuk Semenanjung Malaysia Berkuat Kuasa 10 Jun 2024. Dipetik dari

source: Next Section
ms: Bahagian Seterusnya

source: Go to Top
ms: Kembali ke Atas

source: Bahasa Malaysia
ms: Semenanjung Malaysia

source: English
ms: Bahasa Inggeris

source: PolicyLens - Making Policies Transparent & Understandable
ms: PolicyLens - Menjadikan Dasar Lebih Telus & Difahami

source: Making Policies
ms: Menjadikan Dasar

source: Transparent
ms: Telus

source: Understandable
ms: Mudah Difahami

source: for Everyone
ms: untuk Semua

source: Navigating policies made easy — breaking down complex policies into straightforward, accessible information for everyone.
ms: Menavigasi dasar menjadi mudah — menguraikan dasar kompleks kepada maklumat yang jelas dan mudah diakses oleh semua.

source: Explore Policies
ms: Terokai Dasar

source: Scroll Down
ms: Skrol ke Bawah

source: Diesel Subsidy Reform: What's Going to Cost You?
ms: Reformasi Subsidi Diesel: Apa Kos untuk Anda?

source: Subsidies are changing. Prices are rising.
ms: Subsidi sedang berubah. Harga semakin meningkat.

source: Find out how this new policy could hit your wallet—and what it really means for your daily life.
ms: Ketahui bagaimana dasar baharu ini boleh menjejaskan kewangan anda—dan apa maksud sebenarnya untuk kehidupan harian anda.

source: Explore the Policy
ms: Terokai Dasar Ini

source: The platform helps citizens access policy transparency data by visualizing key metrics and policy impacts across different regions
ms: Platform ini membantu rakyat mengakses data ketelusan dasar dengan memvisualkan metrik utama dan kesan dasar merentasi pelbagai wilayah

source: Malaysians Potentially Impacted
ms: Rakyat Malaysia yang Berkemungkinan Terjejas

source: Malaysia's Transparency Score
ms: Skor Ketelusan Malaysia

source: What We Do?
ms: Apa yang Kami Lakukan?

source: PolicyLens helps Malaysians understand how government decisions affect everyday life, without the jargon.
ms: PolicyLens membantu rakyat Malaysia memahami bagaimana keputusan kerajaan memberi kesan kepada kehidupan harian, tanpa jargon yang rumit.

source: We simplify official policies, break down complex data, and visualize real-world impacts, so you can make informed choices with confidence.
ms: Kami mempermudah dasar rasmi, menghuraikan data kompleks, dan memvisualkan kesan dunia sebenar supaya anda boleh membuat keputusan dengan yakin.

source: Data Dashboard
ms: Papan Pemuka Data

source: Policy Impact Analysis
ms: Analisis Kesan Dasar

source: Educational Resources
ms: Sumber Pendidikan

source: Video Thumbnail
ms: Imej Pratonton Video

source: Why it Matters?
ms: Mengapa Ia Penting?

source: Government policies shape the prices we pay, the jobs we pursue, and the lives we lead.
ms: Dasar kerajaan membentuk harga yang kita bayar, pekerjaan yang kita kejar, dan kehidupan yang kita jalani.

source: But when policies are buried in jargon or distorted by headlines, citizens lose trust and power.
ms: Tetapi apabila dasar diselubungi jargon atau diputarbelitkan oleh tajuk berita, rakyat kehilangan kepercayaan dan kuasa.

source: PolicyLens helps you cut through the noise, understand what's really happening, and make decisions that matter.
ms: PolicyLens membantu anda menapis kekeliruan, memahami apa yang benar-benar berlaku, dan membuat keputusan yang bermakna.

source: Who We Are?
ms: Siapa Kami?

source: We're a group of designers, developers, and researchers from Monash University's School of IT, brought together by a shared frustration: public policies are hard to understand, but they affect all of us.
ms: Kami adalah sekumpulan pereka bentuk, pembangun, dan penyelidik dari Sekolah IT Universiti Monash, disatukan oleh satu kekecewaan bersama: dasar awam sukar difahami, tetapi ia memberi kesan kepada kita semua.

source: So we built PolicyLens, a platform that simplifies complex policies into clear, actionable insights for everyday people.
ms: Jadi kami membina PolicyLens, sebuah platform yang mempermudah dasar yang kompleks menjadi wawasan yang jelas dan boleh diambil tindakan oleh semua orang.

source: We believe informed citizens are empowered citizens and that starts with clarity.
ms: Kami percaya rakyat yang bermaklumat ialah rakyat yang berkuasa, dan semuanya bermula dengan kejelasan.

source: Malaysian Flags
ms: Bendera Malaysia

source: Manufacturing Datasets
ms: Kesan Terhadap Sektor Pembuatan

source: Manufacturing Production Index (IPI)
ms: Apakah Indeks Harga Pengguna (IHP)?

source: Manufacturing Divisions
ms: Kesan Terhadap Sektor Pembuatan

source: Manufacturing Divisions Table
ms: Papan Pemuka Data Pembuatan

source: Series Type
ms: Jenis Siri

source: Absolute Values
ms: Nilai Mutlak

source: Time Period:
ms: Tempoh Masa:

source: All Years
ms: Semua Tahun

source: Series Type:
ms: Jenis Siri:

source: Year on Year Growth
ms: Pertumbuhan Tahunan

source: Month on Month Growth
ms: Pertumbuhan Bulanan

source: IPI by section values were collected from official goverment data centers.
ms: Nilai IPI mengikut seksyen dikumpulkan daripada pusat data rasmi kerajaan.

source: Month:
ms: Bulan:

source: January
ms: Januari

source: February
ms: Februari

source: March
ms: Mac

source: May
ms: Mei

source: June
ms: Jun

source: July
ms: Julai

source: August
ms: Ogos

source: October
ms: Oktober

source: December
ms: Disember

source: Year:
ms: Tahun

source: Display Options:
ms: Pilihan Paparan:

source: Top 10 Divisions
ms: 10 Bahagian Teratas

source: All Divisions
ms: Semua Bahagian

source: Manufacturing Divisions Index
ms: Indeks Bahagian Pembuatan

source: IPI by division values were collected from official goverment data centers.
ms: Nilai IPI mengikut bahagian dikumpul dari pusat data rasmi kerajaan.

source: Division
ms: Bahagian

source: Division Name
ms: Nama Bahagian

source: Index Value
ms: Nilai Indeks

source: YoY Change (%%)
ms: Perubahan Tahun ke Tahun (%%)

source: MoM Change (%%)
ms: Perubahan Bulan ke Bulan (%%)

source: What is Industrial Production Index (IPI)?
ms: Apakah Indeks Pengeluaran Perindustrian (IPI)?

source: Industrial Production Index (IPI) measures the real output of the three main industrial sectors in Malaysia: mining, manufacturing, and electricity. It serves as a key indicator of industrial activity and economic performance.
ms: Indeks Pengeluaran Perindustrian (IPI) mengukur keluaran sebenar tiga sektor perindustrian utama di Malaysia: perlombongan, pembuatan, dan elektrik. Ia berfungsi sebagai petunjuk utama aktiviti perindustrian dan prestasi ekonomi.

source: For this analysis, we focus on how Malaysia's diesel subsidy policy affects the manufacturing sector, which contributes approximately 23%% to the country's GDP and employs over 2.2 million workers.
ms: Untuk analisis ini, kami memberi tumpuan kepada bagaimana dasar subsidi diesel Malaysia memberi kesan kepada sektor pembuatan, yang menyumbang kira-kira 23%% kepada KDNK negara dan menggaji lebih daripada 2.2 juta pekerja.

source: Overall Manufacturing Performance Trend
ms: Trend Prestasi Keseluruhan Sektor Pembuatan

source: Impact on Fuel-Sensitive Manufacturing Sectors
ms: Kesan ke atas Sektor Pembuatan yang Sensitif terhadap Bahan Api

source: Diesel Price Impact Analysis
ms: Analisis Kesan Harga Diesel

source: The chart below shows Malaysia's manufacturing performance from 2023 to early 2025, highlighting the periods before and after major diesel subsidy policy implementations. The absolute index values (2015=100) illustrate the sector's overall performance trajectory.
ms: Carta di bawah menunjukkan prestasi sektor pembuatan Malaysia dari tahun 2023 hingga awal 2025, menonjolkan tempoh sebelum dan selepas pelaksanaan utama dasar subsidi diesel. Nilai indeks mutlak (2015=100) menggambarkan trajektori prestasi keseluruhan sektor tersebut.

source: How the Diesel Subsidy Reform Affects Manufacturing
ms: Bagaimana Pembaharuan Subsidi Diesel Mempengaruhi Pembuatan

source: Higher Costs:
ms: Kos Lebih Tinggi:

source: Diesel prices went up, making production and transport more expensive
ms: Harga diesel meningkat, menjadikan pengeluaran dan pengangkutan lebih mahal

source: SMEs Hit Harder:
ms: PKS Lebih Terjejas:

source: Small and medium factories feel the impact more than large ones
ms: Kilang kecil dan sederhana lebih merasai kesan berbanding kilang besar

source: Slower Output in Late 2024:
ms: Pengeluaran Lebih Perlahan pada Akhir 2024:

source: Short-term boost after policy,followed by a mild decline
ms: Peningkatan jangka pendek selepas dasar, diikuti penurunan sederhana

source: Push for Modernization:
ms: Dorongan ke arah Pemodenan:

source: Encourages cleaner, more fuel-efficient technology
ms: Menggalakkan teknologi yang lebih bersih dan cekap bahan api

source: Ripple Effects on Jobs & Prices:
ms: Kesan Rantaian ke atas Pekerjaan & Harga:

source: Higher costs may affect employment and product prices
ms: Kos yang lebih tinggi boleh menjejaskan pekerjaan dan harga produk

source: Goal of the Policy:
ms: Matlamat Dasar:

source: Target subsidies to those who need them, improve long-term efficiency
ms: Menyalurkan subsidi kepada golongan yang memerlukannya, meningkatkan kecekapan jangka panjang

source: Department of Statistics Malaysia (DOSM), 2024
ms: Jabatan Perangkaan Malaysia (DOSM), 2024

source: Monthly Manufacturing Index (IPI) and Seasonally Adjusted values were obtained from official national statistics, categorized under Section C (Manufacturing) and indexed to base year 2015 = 100.
ms: Indeks Pembuatan Bulanan (IPI) dan nilai Larasan Bermusim diperoleh dari statistik nasional rasmi, dikategorikan di bawah Seksyen C (Pembuatan) dan diindeks kepada tahun asas 2015 = 100.

source: Impact on Fuel-Sensitive Manufacturing Sectors
ms: Kesan Terhadap Sektor Pembuatan Sensitif Bahan Api

source: This analysis visualizes the impact of Malaysia’s diesel subsidy reform on fuel-sensitive manufacturing divisions. It helps identify which sectors are most vulnerable to rising diesel prices by combining industrial production data with fuel price trends.
ms: Analisis ini memvisualisasikan kesan reform subsidi diesel Malaysia ke atas bahagian pembuatan yang sensitif terhadap bahan api. Ia membantu mengenal pasti sektor yang paling terjejas oleh kenaikan harga diesel dengan menggabungkan data pengeluaran industri dan tren harga bahan api.

source: Manufacturing Sector
ms: Sektor Pembuatan

source: Year-on-year Growth(%%)
ms: Pertumbuhan Tahun ke Tahun (%%)

source: Sensitivity score
ms: Skor Sensitiviti

source: Non-metallic Mineral Products
ms: Produk Mineral Bukan Logam

source: Wearing Apparel
ms: Pakaian

source: Paper and Paper Products
ms: Kertas dan Produk Kertas

source: Fabricated Metal Products (excl. Machinery)
ms: Produk Logam Fabrikasi (tidak termasuk Mesin)

source: Machinery Repair and Installation
ms: Pembaikan dan Pemasangan Mesin

source: Chemicals and Chemical Products
ms: Bahan Kimia dan Produk Kimia

source: Other Transport Equipment
ms: Peralatan Pengangkutan Lain

source: Coke and Refined Petroleum Products
ms: Kok dan Produk Petroleum Halus

source: Rubber and Plastics Products
ms: Produk Getah dan Plastik

source: Computer, Electronic, and Optical Products
ms: Produk Komputer, Elektronik dan Optik

source: Methodology Overview:
ms: Metodologi:

source: Fuel Sensitivity Score:
ms: Skor Sensitiviti Bahan Api:
